snlkuharlocal/src/Documents/СчетЗаДоставку/СчетЗаДоставку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетЗаДоставку</name>
  <basedOn>Document.УслугиСтороннихОрганизаций</basedOn>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСчета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СозданаЗаявкаНаОплату</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УСО</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.УслугиСтороннихОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/СчетЗаДоставку/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	если ЭтоНовый() и не ОбменДанными.Загрузка тогда
		Автор=ПараметрыСеанса.Пользователь;
	КонецЕсли;
КонецПроцедуры


Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	//крохин начало 05.10.2021
	//СтандартнаяОбработка=Истина;
	//если СокрЛП(Префикс)="" тогда
	//	УстановитьНомерДокумента(ЭтотОбъект);
	//КонецЕсли;
	#ЕСЛИ КЛИЕНТ ТОГДА
		СтандартнаяОбработка=Истина;
	если СокрЛП(Префикс)="" тогда
		УстановитьНомерДокумента(ЭтотОбъект);
	КонецЕсли;
	#КОНЕЦЕСЛИ	
	//крохин конец 05.10.2021
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	если СозданаЗаявкаНаОплату=Ложь тогда
		для каждого СтрТЧ из УСО цикл
			ТекУСО=СтрТЧ.Документ.ПолучитьОбъект();
			ТекУСО.СозданСчет=Истина;
			ТекУСО.ПерезаписатьДокументБезКонтроля();
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	если не ОбменДанными.Загрузка тогда
		если СозданаЗаявкаНаОплату тогда
			#Если клиент тогда
				Сообщить("На эту заявку уже оформлено ЗНО. Нужно сначала пометить его на удаление");
			#КонецЕсли
			отказ=Истина;
		КонецЕсли;
		если не Отказ тогда
			для каждого СтрТЧ из УСО цикл
				ТекУСО=СтрТЧ.Документ.ПолучитьОбъект();
				ТекУСО.СозданСчет=ложь;
				//Кухарь 02.06.17 начало   
				//будем записывать УСО в закрытом периоде
				//ТекУСО.Записать(РежимЗаписиДокумента.Запись);
				ТекУСО.ПерезаписатьДокументБезКонтроля();
				
				//Кухарь 02.06.17 конец
				
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры
